# MASTER AIPH - TU INF-PROF
# Introduction to Python programming for health data


**Session 2 Learning objectives:**

1. Learning the different data types in pandas: Data frame and series
2. Importing and exporting data into a data frame
2. Subseting data frames
5. Doing transformations with dataframes

# 1. Pandas, Data types and DataFrames
Pandas is a Python library used for working with data sets.

It has functions for analyzing, cleaning, exploring, and manipulating data.

Pandas on-line documentation :
 https://pandas.pydata.org/docs/reference/index.html

In [11]:
#Importing Pandas and verifying the version
import pandas as pd # as allows to create an alias. Use `!pip install pandas` in another cell if you dont have it yet.
import numpy as np

print(pd.__version__) #allow to verify the pandas function

2.2.3

## 1.1 Data types on Pandas :


1.   **Series :** It is a one-dimensional array holding data of any type.
2.  **Dataframes :** Multidimensional data tables holding data of any type. We can think that the series are like the columns of a dataframe whereas the whole table is the dataframe.

In [15]:
# Example series with labels

a = [1, 7, 2.0]

myvar = pd.Series(a, index = ["x", "y", "z"])

print(myvar)

x    1.0
y    7.0
z    2.0
dtype: float64

## 1.2. DataFrames 
DataFrames are multidimensional matrices that can store data of different types.

In [16]:

data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45],
  "category" : ['a','b','c']
}

df = pd.DataFrame(data, index = ["day1", "day2", "day3"])

print(df)

      calories  duration category
day1       420        50        a
day2       380        40        b
day3       390        45        c

In [17]:
students = [ ('jack', 34, 'Sydeny') ,
             ('Riti', 30, 'Delhi' ) ,
             ('Aadi', 16, 'New York') ]
# Create a DataFrame object
dfObj = pd.DataFrame(students, columns = ['Name' , 'Age', 'City'], index=['a', 'b', 'c'])
dfObj

   Name  Age      City
a  jack   34    Sydeny
b  Riti   30     Delhi
c  Aadi   16  New York

**Exercise:** Create a dataframe that stores in one row the person ID, height, weight, sex  and  birthdate. Add at least three examples

In [18]:
data = {'ID': [1,3,5],
       'Height': [5.5,6.7,3.5],
       'Weight': [155,180, 200],
       'Sex': ['Male','F','M'],
       'Birthdate': ['01/01/2000', '01/01/2000', '01/01/2000']
      }
df = pd.DataFrame(data)
print(df)

   ID  Height  Weight   Sex   Birthdate
0   1     5.5     155  Male  01/01/2000
1   3     6.7     180     F  01/01/2000
2   5     3.5     200     M  01/01/2000


[DataFrame attributes](https://pandas.pydata.org/docs/reference/frame.html)

**Exercise:** For the dataframe previously created, go to dataframe attributes and show the following information : 
1. Number of elements
2. Name of the columns
3. Name of the rows
4. Number of rows and columns
5. Show the first rows of the dataframe



Hint1 : https://www.geeksforgeeks.org/dataframe-attributes-in-python-pandas/

Hint2 : print(dir(obj)) https://stackoverflow.com/questions/192109/is-there-a-built-in-function-to-print-all-the-current-properties-and-values-of-a

In [28]:
# Number of elements
df.size

# column names
df.columns

# row names
df.index

# nb of rows and nb of columns 
df.shape

# extract first rows
df.head(1)

df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ID         3 non-null      int64
 1   Height     3 non-null      float64
 2   Weight     3 non-null      int64
 3   Sex        3 non-null      object
 4   Birthdate  3 non-null      object
dtypes: float64(1), int64(2), object(2)
memory usage: 248.0+ bytes

        ID    Height      Weight
count  3.0  3.000000    3.000000
mean   3.0  5.233333  178.333333
std    2.0  1.616581   22.546249
min    1.0  3.500000  155.000000
25%    2.0  4.500000  167.500000
50%    3.0  5.500000  180.000000
75%    4.0  6.100000  190.000000
max    5.0  6.700000  200.000000

## 1.3. Acces the elements of a dataframe :

Access by columns:

In [33]:
df['Height']
df.Height

0    5.5
1    6.7
2    3.5
Name: Height, dtype: float64

### DataFrame.loc | Select Column & Rows by Name


DataFrame provides indexing label loc for selecting columns and rows by names 

dataFrame.loc[ROWS RANGE , COLUMNS RANGE]

In [34]:
df.loc[1,:]

ID                    3
Height              6.7
Weight              180
Sex                   F
Birthdate    01/01/2000
Name: 1, dtype: object

In [38]:
df.loc[0,:]

ID                    1
Height              5.5
Weight              155
Sex                Male
Birthdate    01/01/2000
Name: 0, dtype: object

### DataFrame.iloc | Select Column Indexes & Rows Index Positions
DataFrame provides indexing label iloc for accessing the column and rows by index positions i.e.
*dataFrame.iloc[ROWS INDEX RANGE , COLUMNS INDEX RANGE]*

It selects the columns and rows from DataFrame by index position specified in range. If ‘:’ is given in rows or column Index Range then all entries will be included for corresponding row or column.

In [40]:
df.iloc[:,:]

   ID  Height  Weight   Sex   Birthdate
0   1     5.5     155  Male  01/01/2000
1   3     6.7     180     F  01/01/2000
2   5     3.5     200     M  01/01/2000

## 1.4. Variable conversion :

In [80]:
df_petit = pd.DataFrame({ 'Country': ['France','Spain','Germany', 'Spain','Germany', 'France', 'Italy'], 'Age': [50,60,40,20,40,30, 20] })
df_petit

df_petit.Country.replace("France", np.nan, inplace=True)

df_petit.Country.replace(np.nan, "Was France", inplace=True)
df_petit

C:\Users\lrnv\AppData\Local\Temp\ipykernel_3424\2858300676.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_petit.Country.replace("France", np.nan, inplace=True)
C:\Users\lrnv\AppData\Local\Temp\ipykernel_3424\2858300676.py:6: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_petit.Country.replace(np.nan, "Was France", inplace=True)

      Country  Age
0  Was France   50
1       Spain   60
2     Germany   40
3       Spain   20
4     Germany   40
5  Was France   30
6       Italy   20

#### Label encoding : 
Label Encoding refers to converting the labels into a numeric form so as to convert them into the machine-readable form. Machine learning algorithms can then decide in a better way how those labels must be operated. It is an important pre-processing step for the structured dataset in supervised learning.

In [55]:
df_petit['Country_cat'] = df_petit['Country'].astype('category').cat.codes

In [ ]:
df_petit['Country_cat'] = df_petit['Country'].astype('category').cat.codes
df_petit

   Country  Age  Country_cat
0   France   50            0
1    Spain   60            3
2  Germany   40            1
3    Spain   20            3
4  Germany   40            1
5   France   30            0
6    Italy   20            2

#### One hot encoding

In [47]:
help(pd.get_dummies)

Help on function get_dummies in module pandas.core.reshape.encoding:

get_dummies(data, prefix=None, prefix_sep: 'str | Iterable[str] | dict[str, str]' = '_', dummy_na: 'bool' = False, columns=None, sparse: 'bool' = False, drop_first: 'bool' = False, dtype: 'NpDtype | None' = None) -> 'DataFrame'
    Convert categorical variable into dummy/indicator variables.

    Each variable is converted in as many 0/1 variables as there are different
    values. Columns in the output are each named after a value; if the input is
    a DataFrame, the name of the original variable is prepended to the value.

    Parameters
    ----------
    data : array-like, Series, or DataFrame
        Data of which to get dummy indicators.
    prefix : str, list of str, or dict of str, default None
        String to append DataFrame column names.
        Pass a list with length equal to the number of columns
        when calling get_dummies on a DataFrame. Alternatively, `prefix`
        can be a dictionary mapping column names to prefixes.
    prefix_sep : str, default '_'
        If appending prefix, separator/delimiter to use. Or pass a
        list or dictionary as with `prefix`.
    dummy_na : bool, default False
        Add a column to indicate NaNs, if False NaNs are ignored.
    columns : list-like, default None
        Column names in the DataFrame to be encoded.
        If `columns` is None then all the columns with
        `object`, `string`, or `category` dtype will be converted.
    sparse : bool, default False
        Whether the dummy-encoded columns should be backed by
        a :class:`SparseArray` (True) or a regular NumPy array (False).
    drop_first : bool, default False
        Whether to get k-1 dummies out of k categorical levels by removing the
        first level.
    dtype : dtype, default bool
        Data type for new columns. Only a single dtype is allowed.

    Returns
    -------
    DataFrame
        Dummy-coded data. If `data` contains other columns than the
        dummy-coded one(s), these will be prepended, unaltered, to the result.

    See Also
    --------
    Series.str.get_dummies : Convert Series of strings to dummy codes.
    :func:`~pandas.from_dummies` : Convert dummy codes to categorical ``DataFrame``.

    Notes
    -----
    Reference :ref:`the user guide <reshaping.dummies>` for more examples.

    Examples
    --------
    >>> s = pd.Series(list('abca'))

    >>> pd.get_dummies(s)
           a      b      c
    0   True  False  False
    1  False   True  False
    2  False  False   True
    3   True  False  False

    >>> s1 = ['a', 'b', np.nan]

    >>> pd.get_dummies(s1)
           a      b
    0   True  False
    1  False   True
    2  False  False

    >>> pd.get_dummies(s1, dummy_na=True)
           a      b    NaN
    0   True  False  False
    1  False   True  False
    2  False  False   True

    >>> df = pd.DataFrame({'A': ['a', 'b', 'a'], 'B': ['b', 'a', 'c'],
    ...                    'C': [1, 2, 3]})

    >>> pd.get_dummies(df, prefix=['col1', 'col2'])
       C  col1_a  col1_b  col2_a  col2_b  col2_c
    0  1    True   False   False    True   False
    1  2   False    True    True   False   False
    2  3    True   False   False   False    True

    >>> pd.get_dummies(pd.Series(list('abcaa')))
           a      b      c
    0   True  False  False
    1  False   True  False
    2  False  False   True
    3   True  False  False
    4   True  False  False

    >>> pd.get_dummies(pd.Series(list('abcaa')), drop_first=True)
           b      c
    0  False  False
    1   True  False
    2  False   True
    3  False  False
    4  False  False

    >>> pd.get_dummies(pd.Series(list('abc')), dtype=float)
         a    b    c
    0  1.0  0.0  0.0
    1  0.0  1.0  0.0
    2  0.0  0.0  1.0

In [56]:

df_petit = pd.get_dummies(df_petit,prefix=['Country'], columns = ['Country'])
df_petit.head()

,Age,Country_cat,Country_France,Country_Germany,Country_Italy,Country_Spain
0,50,0,True,False,False,False
1,60,3,False,False,False,True
2,40,1,False,True,False,False
3,20,3,False,False,False,True
4,40,1,False,True,False,False

**Exercise :** Create a dataframe with 3 columns with the characteristics : ID, sex (M or F), frailty degree (FB, M, F).  Convert the categorical variables using label encoding and one-hot-encoding.

In [59]:
df = pd.DataFrame({
    "ID": [1,2,3,4,5,6],
    "Sex": ['M', 'F', 'M','M', 'F', 'M'],
    "FD": ['F','M','FB','F','M','FB']
})
df['Sex_codes'] = df['Sex'].astype('category').cat.codes
pd.get_dummies(df,prefix=['failty_degree'],columns=['FD'],drop_first=True)

   ID Sex  Sex_codes  failty_degree_FB  failty_degree_M
0   1   M          1             False            False
1   2   F          0             False             True
2   3   M          1              True            False
3   4   M          1             False            False
4   5   F          0             False             True
5   6   M          1              True            False

## 1.5. Dealing with dates 
https://pandas.pydata.org/docs/reference/api/pandas.to_datetime.html

In [60]:
#Library to deeal with dates
import datetime

In [61]:
dti = pd.to_datetime(
    ["1/1/2018", np.datetime64("2018-01-01"), datetime.datetime(2018, 1, 1)]
)
dti

DatetimeIndex(['2018-01-01', '2018-01-01', '2018-01-01'], dtype='datetime64[ns]', freq=None)

In [62]:
df = pd.DataFrame({'date': ['3/10/2000', '3/11/2000', '3/12/2000'],
                   'value': [2, 3, 4]})
df['date'] = pd.to_datetime(df['date'])
df

        date  value
0 2000-03-10      2
1 2000-03-11      3
2 2000-03-12      4

### Cutomize the date format

In [65]:
df = pd.DataFrame({'date': ['2016-6-10 20:30', 
                            '2016-7-1 19:45', 
                            '2013-10-12 4:5'],
                   'value': [2, 3, 4]})
df['date'] = pd.to_datetime(df['date'], format="%Y-%d-%m %H:%M")
df

                 date  value
0 2016-10-06 20:30:00      2
1 2016-01-07 19:45:00      3
2 2013-12-10 04:05:00      4

**Exercise :** Check the Pandas documentation and create a dataframe with a columns with dates and try different datetypes.

### Access date elements dt. accessor :
The dt. accessor is an object that allows to access the different data and time elements in a datatime object.
https://pandas.pydata.org/docs/reference/api/pandas.Series.dt.html

In [66]:
df['date_only'] = df['date'].dt.date

df['time_only'] = df['date'].dt.time

df['hour_only'] = df['date'].dt.hour

df

                 date  value   date_only time_only  hour_only
0 2016-10-06 20:30:00      2  2016-10-06  20:30:00         20
1 2016-01-07 19:45:00      3  2016-01-07  19:45:00         19
2 2013-12-10 04:05:00      4  2013-12-10  04:05:00          4

# 2. Importing datasets

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html

In [70]:
df = pd.read_csv("https://raw.githubusercontent.com/rakelup/EPICLIN2021/master/diabetes.csv", sep=",")
df.head()

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1

## 2.1 Data overview

In [71]:
# Data overview
print ('Rows     : ', df.shape[0])
print ('Coloumns  : ', df.shape[1])
print ('\nFeatures : \n', df.columns.tolist())
print ('\nNumber of Missing values:  ', df.isnull().sum().values.sum())
print ('\nNumber of unique values :  \n', df.nunique())

Rows     :  768
Coloumns  :  9

Features :
 ['Pregnancies', 'Glucose', 'BloodPressure', 'SkinThickness', 'Insulin', 'BMI', 'DiabetesPedigreeFunction', 'Age', 'Outcome']

Number of Missing values:   0

Number of unique values :
 Pregnancies                  17
Glucose                     136
BloodPressure                47
SkinThickness                51
Insulin                     186
BMI                         248
DiabetesPedigreeFunction    517
Age                          52
Outcome                       2
dtype: int64

In [ ]:
df.describe()

       Pregnancies     Glucose  ...         Age     Outcome
count   768.000000  768.000000  ...  768.000000  768.000000
mean      3.845052  120.894531  ...   33.240885    0.348958
std       3.369578   31.972618  ...   11.760232    0.476951
min       0.000000    0.000000  ...   21.000000    0.000000
25%       1.000000   99.000000  ...   24.000000    0.000000
50%       3.000000  117.000000  ...   29.000000    0.000000
75%       6.000000  140.250000  ...   41.000000    1.000000
max      17.000000  199.000000  ...   81.000000    1.000000

[8 rows x 9 columns]

In [ ]:
df.columns

Index(['Pregnancies', 'Glucose', 'BloodPressure', 'SkinThickness', 'Insulin',
       'BMI', 'DiabetesPedigreeFunction', 'Age', 'Outcome'],
      dtype='object')

# 3.  Cleaning data in a dataframe: 
1. Dealing with missing values
2. Data in wrong format
3. Wrong data
4. Duplicates

## 3.1. Dealing with missing values : 

Handling missing values is an essential part of data cleaning and preparation process since almost all data in real life comes with some missing values.

### Check for missing values

In [72]:
df.info()
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 768 entries, 0 to 767
Data columns (total 9 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Pregnancies               768 non-null    int64
 1   Glucose                   768 non-null    int64
 2   BloodPressure             768 non-null    int64
 3   SkinThickness             768 non-null    int64
 4   Insulin                   768 non-null    int64
 5   BMI                       768 non-null    float64
 6   DiabetesPedigreeFunction  768 non-null    float64
 7   Age                       768 non-null    int64
 8   Outcome                   768 non-null    int64
dtypes: float64(2), int64(7)
memory usage: 54.1 KB

Pregnancies                 0
Glucose                     0
BloodPressure               0
SkinThickness               0
Insulin                     0
BMI                         0
DiabetesPedigreeFunction    0
Age                         0
Outcome                     0
dtype: int64

 Let's create a daframe with missing values.

In [74]:
df2 = df
df2.Glucose.replace(99, np.nan, inplace=True)
df2.BloodPressure.replace(74, np.nan, inplace=True)

print ('\nNumber of Missing values:  ', df2.isnull().sum())
print ('\nTotal number of missing values :  ', df2.isnull().sum().values.sum())

Number of Missing values:   Pregnancies                  0
Glucose                     17
BloodPressure               52
SkinThickness                0
Insulin                      0
BMI                          0
DiabetesPedigreeFunction     0
Age                          0
Outcome                      0
dtype: int64

Total number of missing values :   69

### First strategy : Removing the whole row that contains a missing value

In [ ]:
# Removing the whole row
df3 = df2.dropna()

print ('\nValeurs manquantes:  ', df3.isnull().sum())
print ('\nValeurs manquantes total:  ', df3.isnull().sum().values.sum())

Valeurs manquantes:   Pregnancies                 0
Glucose                     0
BloodPressure               0
SkinThickness               0
Insulin                     0
BMI                         0
DiabetesPedigreeFunction    0
Age                         0
Outcome                     0
dtype: int64

Valeurs manquantes total:   0

In [75]:


##Replace the missing values

df2.Glucose.replace(np.nan, df['Glucose'].median(), inplace=True)
df2.BloodPressure.replace(np.nan, df['BloodPressure'].median(), inplace=True)

## 3.2 Sorting the data

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sort_values.html

In [85]:
#Trier les données
df.sort_values('Insulin', ascending=False, inplace=True)

**Exercise :** Sort the data in descending order according to the insulin level and store the data in a new Data frame. How to store the data in the same dataframe?

In [81]:
?df.sort_values

Signature:
df.sort_values(
    by: 'IndexLabel',
    *,
    axis: 'Axis' = 0,
    ascending: 'bool | list[bool] | tuple[bool, ...]' = True,
    inplace: 'bool' = False,
    kind: 'SortKind' = 'quicksort',
    na_position: 'str' = 'last',
    ignore_index: 'bool' = False,
    key: 'ValueKeyFunc | None' = None,
) -> 'DataFrame | None'
Docstring:
Sort by the values along either axis.

Parameters
----------
by : str or list of str
    Name or list of names to sort by.

    - if `axis` is 0 or `'index'` then `by` may contain index
      levels and/or column labels.
    - if `axis` is 1 or `'columns'` then `by` may contain column
      levels and/or index labels.
axis : "{0 or 'index', 1 or 'columns'}", default 0
     Axis to be sorted.
ascending : bool or list of bool, default True
     Sort ascending vs. descending. Specify list for multiple sort
     orders.  If this is a list of bools, must match the length of
     the by.
inplace : bool, default False
     If True, perform operation in-place.
kind : {'quicksort', 'mergesort', 'heapsort', 'stable'}, default 'quicksort'
     Choice of sorting algorithm. See also :func:`numpy.sort` for more
     information. `mergesort` and `stable` are the only stable algorithms. For
     DataFrames, this option is only applied when sorting on a single
     column or label.
na_position : {'first', 'last'}, default 'last'
     Puts NaNs at the beginning if `first`; `last` puts NaNs at the
     end.
ignore_index : bool, default False
     If True, the resulting axis will be labeled 0, 1, …, n - 1.
key : callable, optional
    Apply the key function to the values
    before sorting. This is similar to the `key` argument in the
    builtin :meth:`sorted` function, with the notable difference that
    this `key` function should be *vectorized*. It should expect a
    ``Series`` and return a Series with the same shape as the input.
    It will be applied to each column in `by` independently.

Returns
-------
DataFrame or None
    DataFrame with sorted values or None if ``inplace=True``.

See Also
--------
DataFrame.sort_index : Sort a DataFrame by the index.
Series.sort_values : Similar method for a Series.

Examples
--------
>>> df = pd.DataFrame({
...     'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
...     'col2': [2, 1, 9, 8, 7, 4],
...     'col3': [0, 1, 9, 4, 2, 3],
...     'col4': ['a', 'B', 'c', 'D', 'e', 'F']
... })
>>> df
  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F

Sort by col1

>>> df.sort_values(by=['col1'])
  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

Sort by multiple columns

>>> df.sort_values(by=['col1', 'col2'])
  col1  col2  col3 col4
1    A     1     1    B
0    A     2     0    a
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

Sort Descending

>>> df.sort_values(by='col1', ascending=False)
  col1  col2  col3 col4
4    D     7     2    e
5    C     4     3    F
2    B     9     9    c
0    A     2     0    a
1    A     1     1    B
3  NaN     8     4    D

Putting NAs first

>>> df.sort_values(by='col1', ascending=False, na_position='first')
  col1  col2  col3 col4
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F
2    B     9     9    c
0    A     2     0    a
1    A     1     1    B

Sorting with a key function

>>> df.sort_values(by='col4', key=lambda col: col.str.lower())
   col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F

Natural sort with the key argument,
using the `natsort <https://github.com/SethMMorton/natsort>` package.

>>> df = pd.DataFrame({
...    "time": ['0hr', '128hr', '72hr', '48hr', '96hr'],
...    "value": [10, 20, 30, 40, 50]
... })
>>> df
    time  value
0    0hr     10
1  128hr     20
2   72hr     30
3   48hr     40
4   96hr     50
>>> from natsort import index_natsorted
>>> df.sort_values(
...     by="time",
...     key=lambda x: np.argsort(index_natsorted(df["time"]))
... )
    time  value
0    0hr     10
3   48hr     40
2   72hr     30
4   96hr     50
1  128hr     20
File:      c:\users\lrnv\appdata\local\programs\python\python310\lib\site-packages\pandas\core\frame.py
Type:      method

## 3.3. Subseting the data

In [88]:
# df[df['BloodPressure'] >70].count() # Filter by values
df[df['BloodPressure'] > 70].count()

Pregnancies                 341
Glucose                     341
BloodPressure               341
SkinThickness               341
Insulin                     341
BMI                         341
DiabetesPedigreeFunction    341
Age                         341
Outcome                     341
dtype: int64

In [94]:
df_court = df[['Insulin', 'BloodPressure']]

df_court.drop('Insulin', inplace= True, axis = 1)

df_court.head()

     Insulin  BloodPressure
13       846           60.0
228      744           70.0
247      680           90.0
584      600           76.0
409      579           68.0

# 4. Statistics applied to dataframes

`DataFrame.aggregate(func=None, axis=0, *args, **kwargs)`

Aggregate using one or more operations over the specified axis.

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.aggregate.html